{"links": {"self": {"href": "data/repositories/labscript_suite/runmanager/pullrequests/35/comments/99469832.json"}, "html": {"href": "#!/labscript_suite/runmanager/pull-requests/35/_/diff#comment-99469832"}}, "parent": {"id": 99464853, "links": {"self": {"href": "data/repositories/labscript_suite/runmanager/pullrequests/35/comments/99464853.json"}, "html": {"href": "#!/labscript_suite/runmanager/pull-requests/35/_/diff#comment-99464853"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 35, "links": {"self": {"href": "data/repositories/labscript_suite/runmanager/pullrequests/35.json"}, "html": {"href": "#!/labscript_suite/runmanager/pull-requests/35"}}, "title": "Word-wrapping in treeviews and item views, adapted from David Meyer's implementation."}, "content": {"raw": "I’ll wait, there’s no rush. The changes were pretty invasive, so more testing is a good idea.\n\nOne thing I’ve noticed is that automatic sorting of rows every time something changes is actually working after the change to a QTableView for the globals. I hadn’t noticed it, but sorting was _not_ working when it was a TreeView. There is a lot of code for managing sorting in runmanager, and I can’t imagine having written all that in the initial Qt port if it didn’t ever work, so I’m guessing this stopped working at some point - perhaps with Qt5.\n\nBut it turns out that automatic sorting is super annoying! Things jump around randomly and you end up selecting cells you didn’t intend to when clicking on cells after editing other cells.\n\nSo maybe I’ll do it in a separate PR, but I’m wondering if we should just remove most of the sorting code. The user can still cause a sort to happen by clicking on the headers, but I would want to change it so that no automatic sorting would be done when cell contents change. Globals will be loaded from disk ordered by name, so there’ll be that initial sorting but that’s it. There will still need to be a bit of code to make sure “add new global” sorts to the end of the list regardless of sort order \\(I thought this used to be the case, but apparently not anymore\\), but otherwise this would be removing pretty much all of the sorting code. ", "markup": "markdown", "html": "<p>I’ll wait, there’s no rush. The changes were pretty invasive, so more testing is a good idea.</p>\n<p>One thing I’ve noticed is that automatic sorting of rows every time something changes is actually working after the change to a QTableView for the globals. I hadn’t noticed it, but sorting was <em>not</em> working when it was a TreeView. There is a lot of code for managing sorting in runmanager, and I can’t imagine having written all that in the initial Qt port if it didn’t ever work, so I’m guessing this stopped working at some point - perhaps with Qt5.</p>\n<p>But it turns out that automatic sorting is super annoying! Things jump around randomly and you end up selecting cells you didn’t intend to when clicking on cells after editing other cells.</p>\n<p>So maybe I’ll do it in a separate PR, but I’m wondering if we should just remove most of the sorting code. The user can still cause a sort to happen by clicking on the headers, but I would want to change it so that no automatic sorting would be done when cell contents change. Globals will be loaded from disk ordered by name, so there’ll be that initial sorting but that’s it. There will still need to be a bit of code to make sure “add new global” sorts to the end of the list regardless of sort order (I thought this used to be the case, but apparently not anymore), but otherwise this would be removing pretty much all of the sorting code. </p>", "type": "rendered"}, "created_on": "2019-04-21T16:42:28.982291+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2019-04-21T16:42:28.993911+00:00", "type": "pullrequest_comment", "id": 99469832}