{"links": {"self": {"href": "data/repositories/labscript_suite/installer/issues/31/comments/55030821.json"}, "html": {"href": "#!/labscript_suite/installer/issues/31#comment-55030821"}}, "issue": {"links": {"self": {"href": "data/repositories/labscript_suite/installer/issues/31.json"}}, "type": "issue", "id": 31, "repository": {"links": {"self": {"href": "data/repositories/labscript_suite/installer.json"}, "html": {"href": "#!/labscript_suite/installer"}, "avatar": {"href": "data/bytebucket.org/ravatar/{65cd9685-3e8c-4275-9b89-1a7873b341d0}ts=python"}}, "type": "repository", "name": "installer", "full_name": "labscript_suite/installer", "uuid": "{65cd9685-3e8c-4275-9b89-1a7873b341d0}"}, "title": "Tasks required before moving to standard Python packages"}, "content": {"raw": "I thought about what the installer should be, and it's pretty obvious in hindsight!\n\nAll the repos `labscript`, `labscript_devices`, `runviewer`, `runmanager`, `blacs`, `labscript_utils`, will be their own PyPI/conda packages, that depend on each other with specific versions as required. Then there'll be a package which I think would best be called 'labscript-suite', that will depend on all the others - not on any particular versions except as required by the functionality of a script that will come with this package - such that `conda install labscript-suite` or `pip install labscript-suite` will install the latest releases of all the others.\n\nThe problem with `pip/conda` packages alone is that they have no state outside of of site-packages. We still need something that can prompt the user to ask them where they want to put the folder containing `labconfig`, log files, their `userlib`, and app saved configs, create start menu shortcuts, etc (i.e. everything that used to be considered part of a labscript suite 'installation' other then the actual applications/modules).\n\nIt is possible to make post-install scripts that will run after conda/pip install, and even be interactive, but I don't think we want this since we wouldn't want it to run on every upgrade, and there are other things we would want a manually-run script to do anyway, so I think the best solution is to just have the user run a script after doing `pip/conda install`\n\nTo that end, all the stuff that the installer currently creates other than the mercurial clones will be called a 'profile', and the `labscript-suite` package will come with a `labscript-suite-profile` script, with the following subcommands:\n\n`labscript-suite-profile new`\n\nThis is what you will run after a `pip/conda install labscript-suite`. The end result will be the same as if you ran `python setup.py install` with the existing `installer` package.\nThis command will:\n\n* Ask user for a path to create a new profile (default C:\\\\labscript_suite or ~/labscript_suite).\n* Ask the user for a name for the profile. Defaults to nothing, or the conda env name if there is one.\n* Creates all the same things as the current installer, except for cloning repos:\n    * labconfig\n    * log folder\n    * userlib\n    * \"Registers\" the profile with the currently running Python interpreter - see below\n\n`labscript-suite-profile register`\n\nThis is run when creating a new profile, and is what you would run manually if you reinstalled Python (to recreate the .pth file and get the launchers working again), or you wanted to associate the same userlib and labconfig etc with multiple Python installations\n\n* If being run manually, prompts for the path of an existing labscript suite profile (default C:\\\\labscript_suite or ~/labscript_suite).\n* Creates a .pth file in site-packages so that the userlib modules are in the python import path for that interpreter\n* Creates the launchers and their start menu shortcuts.\n\n`labscript-suite-profile deregister`\n\n* Deletes .pth file\n* Deletes launchers and start menu shortcuts. You can do this to intentionally disable a labscript suite profile and switch to another one with the same Python interpreter. You might do this before upgrading Python or similar, to avoid broken launchers and shortcuts in the meantime, though neglecting to do so will not stop the 'register' step from working.\n\n\n`labscript-suite-profile develop`\n\nConfigure the python import path to import some modules directly from git repos instead of from `site-packages`, similar to `python setup.py develop` except not requiring *uninstallation* of the corresponding pip/conda package to work (you can put the repo first in the import path so that it takes precedent, unlike `python setup.py develop` which puts it last), and not requiring manual deletion of files from `site-packages` to reverse.\n\n* With no arguments, or maybe an argument like 'list', lists which repos are currently in development mode.\n* If adding repos to development mode, creates a `development_repos` directory within the profile directory if it doesn't exist.\n* takes a list of repos that should be put into or out of development mode, maybe in a format like \"+labscript, +runmanager, -lyse\" or \"+all\" \"-all\" to add or remove repos from development mode\n* If putting a repo into development mode, clones it into `development_repos` from the given URL prefix (defaulting to labscript suite mainline) if it's not already there. If turning off development mode for a repo, doesn't delete it or anything, just leaves it as is.\n* prepends/removes each repo to the python import path by modifying the labscript suite `.pth` file.\n\nI am pretty sure that if the package is made correctly, the script should end up in the bin directory where the Python interpreter lives, such that the user will be able to run it just as `labscript-suite-profile`, i.e. without the full path or anything. If that turns out not the case then it would be a little more verbose: `python -m labscript-suite-profile`.", "markup": "markdown", "html": "<p>I thought about what the installer should be, and it's pretty obvious in hindsight!</p>\n<p>All the repos <code>labscript</code>, <code>labscript_devices</code>, <code>runviewer</code>, <code>runmanager</code>, <code>blacs</code>, <code>labscript_utils</code>, will be their own PyPI/conda packages, that depend on each other with specific versions as required. Then there'll be a package which I think would best be called 'labscript-suite', that will depend on all the others - not on any particular versions except as required by the functionality of a script that will come with this package - such that <code>conda install labscript-suite</code> or <code>pip install labscript-suite</code> will install the latest releases of all the others.</p>\n<p>The problem with <code>pip/conda</code> packages alone is that they have no state outside of of site-packages. We still need something that can prompt the user to ask them where they want to put the folder containing <code>labconfig</code>, log files, their <code>userlib</code>, and app saved configs, create start menu shortcuts, etc (i.e. everything that used to be considered part of a labscript suite 'installation' other then the actual applications/modules).</p>\n<p>It is possible to make post-install scripts that will run after conda/pip install, and even be interactive, but I don't think we want this since we wouldn't want it to run on every upgrade, and there are other things we would want a manually-run script to do anyway, so I think the best solution is to just have the user run a script after doing <code>pip/conda install</code></p>\n<p>To that end, all the stuff that the installer currently creates other than the mercurial clones will be called a 'profile', and the <code>labscript-suite</code> package will come with a <code>labscript-suite-profile</code> script, with the following subcommands:</p>\n<p><code>labscript-suite-profile new</code></p>\n<p>This is what you will run after a <code>pip/conda install labscript-suite</code>. The end result will be the same as if you ran <code>python setup.py install</code> with the existing <code>installer</code> package.\nThis command will:</p>\n<ul>\n<li>Ask user for a path to create a new profile (default C:\\labscript_suite or ~/labscript_suite).</li>\n<li>Ask the user for a name for the profile. Defaults to nothing, or the conda env name if there is one.</li>\n<li>Creates all the same things as the current installer, except for cloning repos:<ul>\n<li>labconfig</li>\n<li>log folder</li>\n<li>userlib</li>\n<li>\"Registers\" the profile with the currently running Python interpreter - see below</li>\n</ul>\n</li>\n</ul>\n<p><code>labscript-suite-profile register</code></p>\n<p>This is run when creating a new profile, and is what you would run manually if you reinstalled Python (to recreate the .pth file and get the launchers working again), or you wanted to associate the same userlib and labconfig etc with multiple Python installations</p>\n<ul>\n<li>If being run manually, prompts for the path of an existing labscript suite profile (default C:\\labscript_suite or ~/labscript_suite).</li>\n<li>Creates a .pth file in site-packages so that the userlib modules are in the python import path for that interpreter</li>\n<li>Creates the launchers and their start menu shortcuts.</li>\n</ul>\n<p><code>labscript-suite-profile deregister</code></p>\n<ul>\n<li>Deletes .pth file</li>\n<li>Deletes launchers and start menu shortcuts. You can do this to intentionally disable a labscript suite profile and switch to another one with the same Python interpreter. You might do this before upgrading Python or similar, to avoid broken launchers and shortcuts in the meantime, though neglecting to do so will not stop the 'register' step from working.</li>\n</ul>\n<p><code>labscript-suite-profile develop</code></p>\n<p>Configure the python import path to import some modules directly from git repos instead of from <code>site-packages</code>, similar to <code>python setup.py develop</code> except not requiring <em>uninstallation</em> of the corresponding pip/conda package to work (you can put the repo first in the import path so that it takes precedent, unlike <code>python setup.py develop</code> which puts it last), and not requiring manual deletion of files from <code>site-packages</code> to reverse.</p>\n<ul>\n<li>With no arguments, or maybe an argument like 'list', lists which repos are currently in development mode.</li>\n<li>If adding repos to development mode, creates a <code>development_repos</code> directory within the profile directory if it doesn't exist.</li>\n<li>takes a list of repos that should be put into or out of development mode, maybe in a format like \"+labscript, +runmanager, -lyse\" or \"+all\" \"-all\" to add or remove repos from development mode</li>\n<li>If putting a repo into development mode, clones it into <code>development_repos</code> from the given URL prefix (defaulting to labscript suite mainline) if it's not already there. If turning off development mode for a repo, doesn't delete it or anything, just leaves it as is.</li>\n<li>prepends/removes each repo to the python import path by modifying the labscript suite <code>.pth</code> file.</li>\n</ul>\n<p>I am pretty sure that if the package is made correctly, the script should end up in the bin directory where the Python interpreter lives, such that the user will be able to run it just as <code>labscript-suite-profile</code>, i.e. without the full path or anything. If that turns out not the case then it would be a little more verbose: <code>python -m labscript-suite-profile</code>.</p>", "type": "rendered"}, "created_on": "2019-11-29T16:53:37.622733+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2019-11-29T16:55:54.238680+00:00", "type": "issue_comment", "id": 55030821}