{"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/issues/26/comments/54061760.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/issues/26#comment-54061760"}}, "issue": {"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/issues/26.json"}}, "type": "issue", "id": 26, "repository": {"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils.json"}, "html": {"href": "#!/labscript_suite/labscript_utils"}, "avatar": {"href": "data/bytebucket.org/ravatar/{68347210-fb1e-4b58-86c0-bd2c04396e63}ts=249922"}}, "type": "repository", "name": "labscript_utils", "full_name": "labscript_suite/labscript_utils", "uuid": "{68347210-fb1e-4b58-86c0-bd2c04396e63}"}, "title": "Add enum control widget"}, "content": {"raw": "> To be honest I’m not sure if it makes sense to treat them as output types or not…it almost seems like not \\(they seem more like labscript device instantiation arguments?\\), but in that case BLACS has no machinery for allowing device configuration to be modified in manual mode. It all has to be implemented separately in each device tab, which doesn’t seem ideal.\n\nThis is exactly the succinct way to say what I’m looking for. I don’t really need an output, I just want manual control of of some settings without needing to recompile the connectiontable or running a complete shot nor writing everything from scratch. I also like the idea of separating a little from typical instantiation arguments since it makes smart programming those settings a bit more consistent with typical outputs. I’ve already done all this once \\(an SRS lock-in amp\\) and it is really tedious with plenty of boiler-plate that should be recycled.\n\nMight there be room to make a new type of labscript class that is controlled like an output in the BLACS tab but links directly to “device instantiation objects” \\(not “output objects”\\) as far as shots and h5files are concerned? I’m not entirely sure how to think about structure or its implementation but if I’m going to write something from scratch anyway, might as well try to write what I need instead of a kludging on to the output system.", "markup": "markdown", "html": "<blockquote>\n<p>To be honest I’m not sure if it makes sense to treat them as output types or not…it almost seems like not (they seem more like labscript device instantiation arguments?), but in that case BLACS has no machinery for allowing device configuration to be modified in manual mode. It all has to be implemented separately in each device tab, which doesn’t seem ideal.</p>\n</blockquote>\n<p>This is exactly the succinct way to say what I’m looking for. I don’t really need an output, I just want manual control of of some settings without needing to recompile the connectiontable or running a complete shot nor writing everything from scratch. I also like the idea of separating a little from typical instantiation arguments since it makes smart programming those settings a bit more consistent with typical outputs. I’ve already done all this once (an SRS lock-in amp) and it is really tedious with plenty of boiler-plate that should be recycled.</p>\n<p>Might there be room to make a new type of labscript class that is controlled like an output in the BLACS tab but links directly to “device instantiation objects” (not “output objects”) as far as shots and h5files are concerned? I’m not entirely sure how to think about structure or its implementation but if I’m going to write something from scratch anyway, might as well try to write what I need instead of a kludging on to the output system.</p>", "type": "rendered"}, "created_on": "2019-09-24T21:36:22.201949+00:00", "user": {"display_name": "David Meyer", "uuid": "{8df655d6-8661-4957-b4ba-669cef19bf2d}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B8df655d6-8661-4957-b4ba-669cef19bf2d%7D"}, "html": {"href": "https://bitbucket.org/%7B8df655d6-8661-4957-b4ba-669cef19bf2d%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/2a4efe81a17e5aeccdbc4ef2ca2cc463d=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsDM-0.png"}}, "nickname": "dihm", "type": "user", "account_id": "557058:411f7712-e1fa-438c-b578-0359da2d9f06"}, "updated_on": null, "type": "issue_comment", "id": 54061760}