{"links": {"self": {"href": "data/repositories/labscript_suite/blacs/issues/21/comments/37768974.json"}, "html": {"href": "#!/labscript_suite/blacs/issues/21#comment-37768974"}}, "issue": {"links": {"self": {"href": "data/repositories/labscript_suite/blacs/issues/21.json"}}, "type": "issue", "id": 21, "repository": {"links": {"self": {"href": "data/repositories/labscript_suite/blacs.json"}, "html": {"href": "#!/labscript_suite/blacs"}, "avatar": {"href": "data/bytebucket.org/ravatar/{50ed1eb9-8c1b-4afe-a8b8-8e0a33b39a05}ts=249915"}}, "type": "repository", "name": "BLACS", "full_name": "labscript_suite/blacs", "uuid": "{50ed1eb9-8c1b-4afe-a8b8-8e0a33b39a05}"}, "title": "inverted Digital outputs"}, "content": {"raw": "New comment instead of a confusing edit (issue threads don't support nested replies!):\n \nI don't think there are any problems with repeat_pulse_sequence other than those that apply to analog ramps already. It's true that intersecting ramps etc will move the points that the function will be evaluated - which will shift the edges of the pulse train, but that doesn't cause problems  if you have a high enough sample rate. The sample rate should be picked based on how accurate you want the edges to be, not on what the period of your pulses actually are. If you really want a low sample rate though, *and* precise edges, then yes, there's a need for regularly spaced clock ticks that won't be moved by an intersecting ramp, which is related to the \"ramp-splitting\" pull request and not what labscript currently tries to do. (This problem \"exists\" for analog outputs in the sense that, if you have a carefully crafted analog function that makes assumptions about exactly what timepoints it will be evaluated at, you're going to have a bad time)", "markup": "markdown", "html": "<p>New comment instead of a confusing edit (issue threads don't support nested replies!):</p>\n<p>I don't think there are any problems with repeat_pulse_sequence other than those that apply to analog ramps already. It's true that intersecting ramps etc will move the points that the function will be evaluated - which will shift the edges of the pulse train, but that doesn't cause problems  if you have a high enough sample rate. The sample rate should be picked based on how accurate you want the edges to be, not on what the period of your pulses actually are. If you really want a low sample rate though, <em>and</em> precise edges, then yes, there's a need for regularly spaced clock ticks that won't be moved by an intersecting ramp, which is related to the \"ramp-splitting\" pull request and not what labscript currently tries to do. (This problem \"exists\" for analog outputs in the sense that, if you have a carefully crafted analog function that makes assumptions about exactly what timepoints it will be evaluated at, you're going to have a bad time)</p>", "type": "rendered"}, "created_on": "2017-06-22T11:05:53.961763+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2017-06-22T11:07:08.703333+00:00", "type": "issue_comment", "id": 37768974}