{"links": {"self": {"href": "data/repositories/labscript_suite/runviewer/issues/5/comments/37786531.json"}, "html": {"href": "#!/labscript_suite/runviewer/issues/5#comment-37786531"}}, "issue": {"links": {"self": {"href": "data/repositories/labscript_suite/runviewer/issues/5.json"}}, "type": "issue", "id": 5, "repository": {"links": {"self": {"href": "data/repositories/labscript_suite/runviewer.json"}, "html": {"href": "#!/labscript_suite/runviewer"}, "avatar": {"href": "data/bytebucket.org/ravatar/{71215673-ad3e-425c-ae04-84cc6c2ca7da}ts=445022"}}, "type": "repository", "name": "runviewer", "full_name": "labscript_suite/runviewer", "uuid": "{71215673-ad3e-425c-ae04-84cc6c2ca7da}"}, "title": "Markers and nonlinear timescale"}, "content": {"raw": "@PhyNerd So you need the `open_state` parameter to be saved in the HDF5 file in order to access it from runviewer.\n\nThere are 2 places to save it, `device_properties` or `connection_table_properties`. Anything in `connection_table_properties` will be used to make a comparison with the BLACS connection table when shots are submitted. Shots that don't match will be rejected from running. I think it should go in the connection table properties, because the connection table should represent the hardware, and a change of hardware state (such as inverting a shutter) needs to be represented in the connection table (the fact that we don't save it already is an oversight). You don't want to re-run an old shot if the Shutter has been inverted in the meantime!\n\nSo it's not a big deal, it just means you need to recompile your BLACS connection table and you can't re-run old shots. Just something to be aware of.\n\nIt might be worth opening a new issue specifically for the shutter label feature, so we can discuss the runviewer implementation details further before you start writing it. For instance, I think it would be good to define what the runviewer `Shutter` implementation will be allowed to do (can it change the digital trace, or just add additional information to the plot? What additional information should we allow and what data structure/format should we store it in? that sort of thing!)", "markup": "markdown", "html": "<p>@PhyNerd So you need the <code>open_state</code> parameter to be saved in the HDF5 file in order to access it from runviewer.</p>\n<p>There are 2 places to save it, <code>device_properties</code> or <code>connection_table_properties</code>. Anything in <code>connection_table_properties</code> will be used to make a comparison with the BLACS connection table when shots are submitted. Shots that don't match will be rejected from running. I think it should go in the connection table properties, because the connection table should represent the hardware, and a change of hardware state (such as inverting a shutter) needs to be represented in the connection table (the fact that we don't save it already is an oversight). You don't want to re-run an old shot if the Shutter has been inverted in the meantime!</p>\n<p>So it's not a big deal, it just means you need to recompile your BLACS connection table and you can't re-run old shots. Just something to be aware of.</p>\n<p>It might be worth opening a new issue specifically for the shutter label feature, so we can discuss the runviewer implementation details further before you start writing it. For instance, I think it would be good to define what the runviewer <code>Shutter</code> implementation will be allowed to do (can it change the digital trace, or just add additional information to the plot? What additional information should we allow and what data structure/format should we store it in? that sort of thing!)</p>", "type": "rendered"}, "created_on": "2017-06-23T02:00:09.436513+00:00", "user": {"display_name": "Philip Starkey", "uuid": "{48af65db-e5fc-459c-a7eb-52eb1f9a5690}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D"}, "html": {"href": "https://bitbucket.org/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/dc318537facc47ebe1ae98a7aabacecfd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsPS-0.png"}}, "nickname": "pstarkey", "type": "user", "account_id": "557058:52a111e4-40da-4441-9143-417f95f2db97"}, "updated_on": null, "type": "issue_comment", "id": 37786531}