{"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/31/comments/57756786.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/31/_/diff#comment-57756786"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 31, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/31.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/31"}}, "title": "Unit conversions Python3 bugfix and cleanup"}, "content": {"raw": "* Did you test with more than one derived unit \\(most notably that the order of the derived units along with autogenerated derived units with prefixes stays the same between the old code and the new code\\). I think it does, but your test case only shows using one derived unit \\('W'\\).  \n* I don't think that grepping for `UnitConversion.units` is sufficient as most of the internal code throughout the labscript suite works with instantiated unit conversions \\(with a dynamic class name used in determining the type of object to instantiate\\). Probably nothing uses it....but it's not guaranteed and that also doesn't stop people having used it when creating unit conversions that have not been committed back to the repository. The same goes for the class attribute `unit_list` that is now `_magnitude_list`.  \n* Could you expand on what you mean by \"that nothing was depending on the fact that the metric prefix conversion factors were previously strings.\" because I don't understand what you mean  \n* Could you verify that the selected unit in BLACS is restored correctly \\(and that the unit conversion is correctly applied\\) when switching between the old code and the new code \\(as in, value saved when closing BLACS running the old code, everything is correct when launching BLACS with the new code\\).   \n* Somewhat related to the last point....I notice that `derived_units` seems to contain unicode strings under Python 2 now, is this a problem compatibility wise \\(for instance when saving/loading from HDF5 files, etc or comparing between HDF5 files produces under different versions of this code\\)  \n\nThink that all the comments I have for now!\n\n‌", "markup": "markdown", "html": "<ul>\n<li>Did you test with more than one derived unit (most notably that the order of the derived units along with autogenerated derived units with prefixes stays the same between the old code and the new code). I think it does, but your test case only shows using one derived unit ('W').  </li>\n<li>I don't think that grepping for <code>UnitConversion.units</code> is sufficient as most of the internal code throughout the labscript suite works with instantiated unit conversions (with a dynamic class name used in determining the type of object to instantiate). Probably nothing uses it....but it's not guaranteed and that also doesn't stop people having used it when creating unit conversions that have not been committed back to the repository. The same goes for the class attribute <code>unit_list</code> that is now <code>_magnitude_list</code>.  </li>\n<li>Could you expand on what you mean by \"that nothing was depending on the fact that the metric prefix conversion factors were previously strings.\" because I don't understand what you mean  </li>\n<li>Could you verify that the selected unit in BLACS is restored correctly (and that the unit conversion is correctly applied) when switching between the old code and the new code (as in, value saved when closing BLACS running the old code, everything is correct when launching BLACS with the new code).   </li>\n<li>Somewhat related to the last point....I notice that <code>derived_units</code> seems to contain unicode strings under Python 2 now, is this a problem compatibility wise (for instance when saving/loading from HDF5 files, etc or comparing between HDF5 files produces under different versions of this code)  </li>\n</ul>\n<p>Think that all the comments I have for now!</p>\n<p>‌</p>", "type": "rendered"}, "created_on": "2018-03-02T06:48:07.857946+00:00", "user": {"display_name": "Philip Starkey", "uuid": "{48af65db-e5fc-459c-a7eb-52eb1f9a5690}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D"}, "html": {"href": "https://bitbucket.org/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/dc318537facc47ebe1ae98a7aabacecfd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsPS-0.png"}}, "nickname": "pstarkey", "type": "user", "account_id": "557058:52a111e4-40da-4441-9143-417f95f2db97"}, "updated_on": "2018-03-02T06:48:07.861734+00:00", "type": "pullrequest_comment", "id": 57756786}