{"links": {"self": {"href": "data/repositories/labscript_suite/installer/pullrequests/9/comments/99040921.json"}, "html": {"href": "#!/labscript_suite/installer/pull-requests/9/_/diff#comment-99040921"}}, "parent": {"id": 98731197, "links": {"self": {"href": "data/repositories/labscript_suite/installer/pullrequests/9/comments/98731197.json"}, "html": {"href": "#!/labscript_suite/installer/pull-requests/9/_/diff#comment-98731197"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 9, "links": {"self": {"href": "data/repositories/labscript_suite/installer/pullrequests/9.json"}, "html": {"href": "#!/labscript_suite/installer/pull-requests/9"}}, "title": "Much more detailed installation and setup instructions."}, "content": {"raw": "Thanks for checking it out!\n\n* I don’t recall exactly why I recommend install “just for me”. It might be because some things needed to run as administrator on some systems when installed “for all users”. I know one lab here runs all labscript suite programs as administrator after having installed “for all users” \\(and this is something of a legacy system so we’re not going to fix it until switching to mainline labscript\\). Perhaps this is only an issue on fairly locked-down systems like the Windows computers we have at NIST, though.\n* I’m not sure about instructions for creating a conda environment - do you think this is a good idea to recommend that users install to an environment other than the base one as a matter of course? I would have thought they should only do this if they have a specific reason. Or you just want to provide the info as an FYI? If so, perhaps a link to conda documentation would suffice.\n* Trustworthy people say good things about VS Code, so even though I haven’t tried it myself I agree it’s probably near the top, if not at the top, of best cross-platform editors \\(I really like sublime, but it is not free or open source, which rubs a lot of people the wrong way\\). So I’m in favour of including it. Perhaps we can just link to a decent “using VSCode for Python” tutorial rather than write too much ourselves. If it’s anything like Atom \\(I see it as a kind of spiritual fork of it\\), one thing that bugged me was that atom would automatically strip end-of-line whitespace in the whole file. For new code this is fine, but it makes the diffs unusable when editing code that has errant whitespace already. So If VSCode does that, we should include a suggestion to turn it off if they are going to be hacking on labscript-suite code. Sublime is a bit cleverer and only trims the whitespace on lines you’re editing, which is better. But if VSCode is like Atom, this was a serious pain point for collaborative work!\n\n‌", "markup": "markdown", "html": "<p>Thanks for checking it out!</p>\n<ul>\n<li>I don’t recall exactly why I recommend install “just for me”. It might be because some things needed to run as administrator on some systems when installed “for all users”. I know one lab here runs all labscript suite programs as administrator after having installed “for all users” (and this is something of a legacy system so we’re not going to fix it until switching to mainline labscript). Perhaps this is only an issue on fairly locked-down systems like the Windows computers we have at NIST, though.</li>\n<li>I’m not sure about instructions for creating a conda environment - do you think this is a good idea to recommend that users install to an environment other than the base one as a matter of course? I would have thought they should only do this if they have a specific reason. Or you just want to provide the info as an FYI? If so, perhaps a link to conda documentation would suffice.</li>\n<li>Trustworthy people say good things about VS Code, so even though I haven’t tried it myself I agree it’s probably near the top, if not at the top, of best cross-platform editors (I really like sublime, but it is not free or open source, which rubs a lot of people the wrong way). So I’m in favour of including it. Perhaps we can just link to a decent “using VSCode for Python” tutorial rather than write too much ourselves. If it’s anything like Atom (I see it as a kind of spiritual fork of it), one thing that bugged me was that atom would automatically strip end-of-line whitespace in the whole file. For new code this is fine, but it makes the diffs unusable when editing code that has errant whitespace already. So If VSCode does that, we should include a suggestion to turn it off if they are going to be hacking on labscript-suite code. Sublime is a bit cleverer and only trims the whitespace on lines you’re editing, which is better. But if VSCode is like Atom, this was a serious pain point for collaborative work!</li>\n</ul>\n<p>‌</p>", "type": "rendered"}, "created_on": "2019-04-16T21:01:49.530060+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2019-04-16T21:01:49.542103+00:00", "type": "pullrequest_comment", "id": 99040921}