{"links": {"self": {"href": "data/repositories/labscript_suite/blacs/pullrequests/32/comments/58610452.json"}, "html": {"href": "#!/labscript_suite/blacs/pull-requests/32/_/diff#comment-58610452"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 32, "links": {"self": {"href": "data/repositories/labscript_suite/blacs/pullrequests/32.json"}, "html": {"href": "#!/labscript_suite/blacs/pull-requests/32"}}, "title": "Absolute imports, and don't use __file__"}, "content": {"raw": "Happy to merge provided you've seen one of the plugins successfully make a notification \\(e.g. connection table recompile notification\\). EDIT: wait was this already merged when I posted this? There are too many things to keep track of!\n\nsemi-unrelated: I think the reason why the BLACS window isn't always associated with the icon on windows might be that the `relaunch_command`is sent to the win32 API but that value was not derived from `sys.argv` which is actually what we use when relaunching BLACS in order to preserve any custom arguments. This probably causes a mismatch and so you see the BLACS window get associated with something else \\(sometimes a new icon, sometimes runmanager for some reason\\). Just a thought anyway! Not really necessary to fix in this pull request if you can't be bothered, I'm just mentioning it because that piece of code was slightly updated here.", "markup": "markdown", "html": "<p>Happy to merge provided you've seen one of the plugins successfully make a notification (e.g. connection table recompile notification). EDIT: wait was this already merged when I posted this? There are too many things to keep track of!</p>\n<p>semi-unrelated: I think the reason why the BLACS window isn't always associated with the icon on windows might be that the <code>relaunch_command</code>is sent to the win32 API but that value was not derived from <code>sys.argv</code> which is actually what we use when relaunching BLACS in order to preserve any custom arguments. This probably causes a mismatch and so you see the BLACS window get associated with something else (sometimes a new icon, sometimes runmanager for some reason). Just a thought anyway! Not really necessary to fix in this pull request if you can't be bothered, I'm just mentioning it because that piece of code was slightly updated here.</p>", "type": "rendered"}, "created_on": "2018-03-13T00:13:01.880816+00:00", "user": {"display_name": "Philip Starkey", "uuid": "{48af65db-e5fc-459c-a7eb-52eb1f9a5690}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D"}, "html": {"href": "https://bitbucket.org/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/dc318537facc47ebe1ae98a7aabacecfd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsPS-0.png"}}, "nickname": "pstarkey", "type": "user", "account_id": "557058:52a111e4-40da-4441-9143-417f95f2db97"}, "updated_on": "2018-03-13T00:14:47.136094+00:00", "type": "pullrequest_comment", "id": 58610452}