{"links": {"self": {"href": "data/repositories/labscript_suite/labscript_devices/pullrequests/63/comments/99173457.json"}, "html": {"href": "#!/labscript_suite/labscript_devices/pull-requests/63/_/diff#comment-99173457"}}, "parent": {"id": 99069771, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_devices/pullrequests/63/comments/99069771.json"}, "html": {"href": "#!/labscript_suite/labscript_devices/pull-requests/63/_/diff#comment-99069771"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 63, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_devices/pullrequests/63.json"}, "html": {"href": "#!/labscript_suite/labscript_devices/pull-requests/63"}}, "title": "IMAQdxCamera"}, "content": {"raw": "Cool, serial number it is.\n\nI don’t think not setting the timeout is a regression: it used to be shot\\_duration plus 5 seconds unless the user sets it otherwise, now it’s 5 seconds unless the user sets it otherwise. In either case for a failed acquisition a timeout will occur within or at 5 seconds of the end of the shot, which will allow the abort\\(\\) to run. User-visible behaviour is the same, except that with the 5 second timeout an abort can also be performed earlier.\n\nAh, a pertinent bit of info that could be causing a misunderstanding is that all attributes are reset to defaults at the start of each IMAQdx session \\(i.e. when BLACS starts\\) - this means we can be sure that the timeout is 5 seconds unless the user has explicitly set it otherwise in the current connection table \\(or changed it in NI MAX and saved it as a new default\\).  A possible issue is that if the user sets attributes on a shot-by-shot basis \\(currently allowed, but no good syntax for it in labscript since they are instantiation arguments\\), then attributes set on previous shots, but not specified for later shots, will retain their earlier values leading to ordering effects in running shots. To solve this, I think there is a reset function - I would guess that would set all the attributes back to default. Might be worth running that during transition\\_to\\_manual, so long as it is not as slow as initiating communication with the camera in the first place \\(which takes several seconds\\). If that works how I think it does, then we could be perfectly sure that each shot runs exactly as specified without any non-default settings from previous shots remaining.", "markup": "markdown", "html": "<p>Cool, serial number it is.</p>\n<p>I don’t think not setting the timeout is a regression: it used to be shot_duration plus 5 seconds unless the user sets it otherwise, now it’s 5 seconds unless the user sets it otherwise. In either case for a failed acquisition a timeout will occur within or at 5 seconds of the end of the shot, which will allow the abort() to run. User-visible behaviour is the same, except that with the 5 second timeout an abort can also be performed earlier.</p>\n<p>Ah, a pertinent bit of info that could be causing a misunderstanding is that all attributes are reset to defaults at the start of each IMAQdx session (i.e. when BLACS starts) - this means we can be sure that the timeout is 5 seconds unless the user has explicitly set it otherwise in the current connection table (or changed it in NI MAX and saved it as a new default).  A possible issue is that if the user sets attributes on a shot-by-shot basis (currently allowed, but no good syntax for it in labscript since they are instantiation arguments), then attributes set on previous shots, but not specified for later shots, will retain their earlier values leading to ordering effects in running shots. To solve this, I think there is a reset function - I would guess that would set all the attributes back to default. Might be worth running that during transition_to_manual, so long as it is not as slow as initiating communication with the camera in the first place (which takes several seconds). If that works how I think it does, then we could be perfectly sure that each shot runs exactly as specified without any non-default settings from previous shots remaining.</p>", "type": "rendered"}, "created_on": "2019-04-17T15:32:00.277984+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2019-04-17T15:32:00.289864+00:00", "type": "pullrequest_comment", "id": 99173457}