{"links": {"self": {"href": "data/repositories/labscript_suite/runviewer/pullrequests/16/comments/45673858.json"}, "html": {"href": "#!/labscript_suite/runviewer/pull-requests/16/_/diff#comment-45673858"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 16, "links": {"self": {"href": "data/repositories/labscript_suite/runviewer/pullrequests/16.json"}, "html": {"href": "#!/labscript_suite/runviewer/pull-requests/16"}}, "title": "Channel configs"}, "content": {"raw": "Finally getting around to reviewing this!\n\nThoughts:\n\n* The ordering of the channels are not preserved through save load. The most naive solution is to save using an `OrderedDict` instead. Probably need some logic to change the position of existing channels \\(into the position that was saved\\) if there are already loaded shots\n* Should we only save channels that are ticked? Is there really a need to load in unticked channels? Because if they exist in the shot, they'll appear unticked anyway once that is loaded, and if they don't then why have them? I can maybe see a rare scenario where you want to save the position of an unticked channel, but the only way to cleanly solve all of these suggestions would be to allow the user to specify which channels to save, rather than saving them all \\(which seems like a much bigger project, and should be deferred into an additional pull request - or just not done at all\\)\n\n", "markup": "markdown", "html": "<p>Finally getting around to reviewing this!</p>\n<p>Thoughts:</p>\n<ul>\n<li>The ordering of the channels are not preserved through save load. The most naive solution is to save using an <code>OrderedDict</code> instead. Probably need some logic to change the position of existing channels (into the position that was saved) if there are already loaded shots</li>\n<li>Should we only save channels that are ticked? Is there really a need to load in unticked channels? Because if they exist in the shot, they'll appear unticked anyway once that is loaded, and if they don't then why have them? I can maybe see a rare scenario where you want to save the position of an unticked channel, but the only way to cleanly solve all of these suggestions would be to allow the user to specify which channels to save, rather than saving them all (which seems like a much bigger project, and should be deferred into an additional pull request - or just not done at all)</li>\n</ul>", "type": "rendered"}, "created_on": "2017-09-25T05:24:23.871583+00:00", "user": {"display_name": "Philip Starkey", "uuid": "{48af65db-e5fc-459c-a7eb-52eb1f9a5690}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D"}, "html": {"href": "https://bitbucket.org/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/dc318537facc47ebe1ae98a7aabacecfd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsPS-0.png"}}, "nickname": "pstarkey", "type": "user", "account_id": "557058:52a111e4-40da-4441-9143-417f95f2db97"}, "updated_on": "2017-09-25T05:24:23.873785+00:00", "type": "pullrequest_comment", "id": 45673858}