{"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/8/comments/38862596.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/8/_/diff#comment-38862596"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 8, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/8.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/8"}}, "title": "Icons and smaller buttons for toolpalette widget"}, "content": {"raw": "Yeah, I feel like there was a reason for the use of the `QTimer`, but I can't remember what. There is a good chance I was just wrong and didn't need it as you say. Have to checked to make sure that resizing doesn't adversely block the main thread during a running shot? I'm wondering if maybe it slows down the rapid checking of the pulseblaster, or even blocks the main thread in some instances? I do remember trying to avoid those sort of things (but maybe I'm getting confused with drag-drop of shots into the queue blocking the main thread?). I'm pretty sure somewhere there is a user interaction that blocks the main thread, and I tried to avoid it. \n\nMaybe @shaunj can check some of these things quickly?", "markup": "markdown", "html": "<p>Yeah, I feel like there was a reason for the use of the <code>QTimer</code>, but I can't remember what. There is a good chance I was just wrong and didn't need it as you say. Have to checked to make sure that resizing doesn't adversely block the main thread during a running shot? I'm wondering if maybe it slows down the rapid checking of the pulseblaster, or even blocks the main thread in some instances? I do remember trying to avoid those sort of things (but maybe I'm getting confused with drag-drop of shots into the queue blocking the main thread?). I'm pretty sure somewhere there is a user interaction that blocks the main thread, and I tried to avoid it. </p>\n<p>Maybe @shaunj can check some of these things quickly?</p>", "type": "rendered"}, "created_on": "2017-06-14T23:18:22.898070+00:00", "user": {"display_name": "Philip Starkey", "uuid": "{48af65db-e5fc-459c-a7eb-52eb1f9a5690}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D"}, "html": {"href": "https://bitbucket.org/%7B48af65db-e5fc-459c-a7eb-52eb1f9a5690%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/dc318537facc47ebe1ae98a7aabacecfd=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsPS-0.png"}}, "nickname": "pstarkey", "type": "user", "account_id": "557058:52a111e4-40da-4441-9143-417f95f2db97"}, "updated_on": "2017-06-14T23:18:22.907554+00:00", "type": "pullrequest_comment", "id": 38862596}