{"links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/68/comments/91032443.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/68/_/diff#comment-91032443"}}, "parent": {"id": 91032369, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/68/comments/91032369.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/68/_/diff#comment-91032369"}}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 68, "links": {"self": {"href": "data/repositories/labscript_suite/labscript_utils/pullrequests/68.json"}, "html": {"href": "#!/labscript_suite/labscript_utils/pull-requests/68"}}, "title": "Winshell exe removal"}, "content": {"raw": "It seems to work excellently - I’ve got two pinned lyse launchers on the panel for different envs, and their windows associate with the correct one.  If I launch from a terminal with ‘python -m lyse’ it associates with the correct one depending on what environment I’m launching from. however, this is because the _install directory_ is part of the appid, so they are already kept separate.\n\nFor the case where you might have two environments hooked up to the _same_ labscript install, it presumably won’t work, so I think we should add the environment to the appID as well.\n\nTo support this officially, I’m looking into considering ‘installing' and ‘registering’ to be two different things - installing would mean putting the labscript suite files in a folder, and ‘registering’ would be putting the .pth file in the Python environment and creating start menu shortcuts. In this way you could ‘register’ the same install with multiple Python environments. Or, more what I’m thinking, you could re-attach the labscript suite to a new anaconda if you need to bomb out your anaconda install for some reason \\(I’m also thinking that depending on where the .pth file is exactly, it may be removed if the minor version of Python is updated in a conda environment\\). I’ve already been doing this more or less to test the same code on both Python 2 and Python 3 without making two labscript suite installs.\n\nThis might as well be supported - the installer does it anyway, I’m just thinking of exposing that functionality in the script that gets left in the labscript suite directory, it’s currently called ‘uninstall.py’ but it’s actually the same script as the installer, just with different options available. So I’m thinking of renaming it ‘manage.py’ and exposing a ‘register’ and ‘unregister’ command to hook and unhook it from different python envs, and to add and remove shortcuts, without changing the actual labscript suite files on disk. It would also be able to detect dangling shortcuts and clean them up, this would not be hard and would ensure things remain neat without having to reinstall.\n\nThat’s a \\(slightly\\) bigger job, but I’m looking into improving installing at the moment anyway so I’ll probably get to it, but it’s totally consistent with just including the env in the appid. I’ll include the file path to the current conda environment as well as the install directory.", "markup": "markdown", "html": "<p>It seems to work excellently - I’ve got two pinned lyse launchers on the panel for different envs, and their windows associate with the correct one.  If I launch from a terminal with ‘python -m lyse’ it associates with the correct one depending on what environment I’m launching from. however, this is because the <em>install directory</em> is part of the appid, so they are already kept separate.</p>\n<p>For the case where you might have two environments hooked up to the <em>same</em> labscript install, it presumably won’t work, so I think we should add the environment to the appID as well.</p>\n<p>To support this officially, I’m looking into considering ‘installing' and ‘registering’ to be two different things - installing would mean putting the labscript suite files in a folder, and ‘registering’ would be putting the .pth file in the Python environment and creating start menu shortcuts. In this way you could ‘register’ the same install with multiple Python environments. Or, more what I’m thinking, you could re-attach the labscript suite to a new anaconda if you need to bomb out your anaconda install for some reason (I’m also thinking that depending on where the .pth file is exactly, it may be removed if the minor version of Python is updated in a conda environment). I’ve already been doing this more or less to test the same code on both Python 2 and Python 3 without making two labscript suite installs.</p>\n<p>This might as well be supported - the installer does it anyway, I’m just thinking of exposing that functionality in the script that gets left in the labscript suite directory, it’s currently called ‘uninstall.py’ but it’s actually the same script as the installer, just with different options available. So I’m thinking of renaming it ‘manage.py’ and exposing a ‘register’ and ‘unregister’ command to hook and unhook it from different python envs, and to add and remove shortcuts, without changing the actual labscript suite files on disk. It would also be able to detect dangling shortcuts and clean them up, this would not be hard and would ensure things remain neat without having to reinstall.</p>\n<p>That’s a (slightly) bigger job, but I’m looking into improving installing at the moment anyway so I’ll probably get to it, but it’s totally consistent with just including the env in the appid. I’ll include the file path to the current conda environment as well as the install directory.</p>", "type": "rendered"}, "created_on": "2019-02-10T03:47:26.584832+00:00", "user": {"display_name": "Chris Billington", "uuid": "{e363c5a9-5075-4656-afb5-88bd6a6dceeb}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D"}, "html": {"href": "https://bitbucket.org/%7Be363c5a9-5075-4656-afb5-88bd6a6dceeb%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/9238baf7300c41c0e7294db922899e6ad=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsCB-1.png"}}, "nickname": "cbillington", "type": "user", "account_id": "557058:cbf1bc43-1dc2-477b-9e25-1a8f40fd7ee3"}, "updated_on": "2019-02-10T03:47:26.594096+00:00", "type": "pullrequest_comment", "id": 91032443}